/* -------------------------------- IdEntity --------------------------------
id              bigint          NOT NULL    auto_increment          COMMENT '编号',
create_by       varchar(255)    NOT NULL                            COMMENT '创建者',
create_date     datetime(3)        NOT NULL                         COMMENT '创建时间',
update_by       varchar(255)                                        COMMENT '更新者',
update_date     datetime(3)                                         COMMENT '更新时间',
del_flag        char(1)         NOT NULL    DEFAULT '1'             COMMENT '删除标记（1：正常；2：删除；3：审核）',

PRIMARY KEY (id)

（1：正常；2：删除；3：审核）
（0：否；1：是）
（0：隐藏；1：显示）

-------------------------------- IdEntity -------------------------------- */

-- CREATE DATABASE clever-devops;

/* ====================================================================================================================
    代码仓库
==================================================================================================================== */
CREATE TABLE code_repository
(
    id              bigint          NOT NULL    auto_increment          COMMENT '编号',
    create_by       varchar(255)    NOT NULL                            COMMENT '创建者',
    create_date     datetime(3)     NOT NULL                            COMMENT '创建时间',
    update_by       varchar(255)                                        COMMENT '更新者',
    update_date     datetime(3)                                         COMMENT '更新时间',


    PRIMARY KEY (id)
) COMMENT = '';
/*------------------------------------------------------------------------------------------------------------------------
项目名称
访问域名
默认运行实例数
描述
项目语言(Java Node Go PHP)
repository_url 代码仓库地址
代码仓库版本管理方式 Git Svn
代码仓库是否需要授权
代码仓库授权类型 1：用户名密码 2：token
代码仓库授权信息
--------------------------------------------------------------------------------------------------------------------------*/


/* ====================================================================================================================
    Docker镜像与代码项目关联信息
==================================================================================================================== */
CREATE TABLE 
(
    id              bigint          NOT NULL    auto_increment          COMMENT '编号',
    create_by       varchar(255)    NOT NULL                            COMMENT '创建者',
    create_date     datetime(3)     NOT NULL                            COMMENT '创建时间',
    update_by       varchar(255)                                        COMMENT '更新者',
    update_date     datetime(3)                                         COMMENT '更新时间',


    PRIMARY KEY (id)
) COMMENT = '';
/*------------------------------------------------------------------------------------------------------------------------
代码仓库ID
代码提交ID(commitID)
代码branch或Tag
当前构建状态(构建完成, 构建失败, 正在下载代码, 正在编译代码, 正在构建镜像)
代码下载临时文件夹路径
Docker镜像ID
镜像开始构建时间
镜像结束构建时间
代码构建日志(代码下载、编译、构建镜像日志)
镜像说明
--------------------------------------------------------------------------------------------------------------------------*/




/* ====================================================================================================================
    
==================================================================================================================== */
CREATE TABLE 
(
    id              bigint          NOT NULL    auto_increment          COMMENT '编号',
    create_by       varchar(255)    NOT NULL                            COMMENT '创建者',
    create_date     datetime(3)     NOT NULL                            COMMENT '创建时间',
    update_by       varchar(255)                                        COMMENT '更新者',
    update_date     datetime(3)                                         COMMENT '更新时间',


    PRIMARY KEY (id)
) COMMENT = '字典表';
/*------------------------------------------------------------------------------------------------------------------------

--------------------------------------------------------------------------------------------------------------------------*/


